[
  {
    "position": "Frontend Web Entwickler",
    "url": "https://berlinstartupjobs.com/engineering/frontend-web-entwickler-interhome-gmbh-part-of-hotelplan-group",
    "skills": "TypeScript, VueJS, NUXT, HTML, CSS, TailWind",
    "bulkText": "Deine Aufgaben Gemeinsam mit Kolleginnen und Kollegen in Deinem Team entwickelst Du die verschiedenen Webseiten und Webanwendungen der Interhome Group weiter Du programmierst Webseiten und Progressive Webapps in modernen Webtechnologien Technische Umsetzung von Designs in CSS Du bist ein/e Vollblut-Software-Entwickler/in und bringst folgende Skills mit: Gute Kenntnisse in Javascript und optional Typescript, insbesondere VueJS und NUXT Gute allgemeine Kenntnisse von HTML, CSS (Kenntnisse von TailwindCSS sind von Vorteil) Interesse an neuen Technologien sowie Spaß am Entwickeln Gute Deutsch- und Englischkenntnisse Teamfähigkeit und Kommunikationsstärke Projekterfahrung als Entwickler/in sind von Vorteil Idealerweise DevOps-Erfahrung (Kubernetes, AgroCD, Ranger) sowie Erfahrung mit Progressive Webapps Ein (Fach)-hochschulabschluss oder eine abgeschlossene Ausbildung im Bereich Informatik sind von Vorteil Was Dich erwartet Spannende und vielseitige Projekte in einem internationalen Umfeld Die Möglichkeit, im Herzen von Berlin oder in der sonnigsten Stadt Deutschlands, in Freiburg, zu arbeiten Betriebliche Altersvorsorge und die Möglichkeit zu flexiblem, hybriden Arbeiten (Homeoffice) Attraktive Mitarbeiterrabatte und Sportangebote (Hansefit)"
  },
  {
    "position": "React Native Mobile Developer",
    "url": "https://berlinstartupjobs.com/engineering/react-native-mobile-developer-prospr-at-work",
    "skills": "Node.js, React, React Native, Firebase, Socket.io, Redis, MySQL, AWS",
    "bulkText": "Working With Us You’ll build new product features from start to finish: through conception, research, development, refinement, documentation and maintenance.  You’ll work on key initiatives to keep our systems elegant and productivity high.  You’ll build and improve processes and internal tools with simplicity and productivity in mind.  You’ll gain ownership and domain expertise over part of the codebase, and contribute to growing it in accordance with our standards and best practices.  You will review code from your peers.  You will mentor more junior developers.  You will have the option of contributing to our team blog.  You will collaborate as a team on product vision and software design decisions.  What You Bring 3+ years of experience Shipped and maintained code in production; experience with SaaS/B2B products a plus.  Expert knowledge of Javascript Advanced knowledge of React Native and either Java/Android SDK or Swift/C# Familiarity with Firebase and strong knowledge of Android Studio or Xcode Meticulous mindset but you also understand that software engineering is about making trade-offs, balancing business and technical needs Good communication skills, comfortable working in a team, and can easily work with non-technical colleagues Fluent in English Why Work With Us The best tools: MacBook Pro, 34” UltraWide Monitor, Beats Headphones Learning Budget: EUR 3.000 / year Urban Sports Club Membership Monthly BVG Ticket Annual Team Retreat Competitive Salary: €70k – €85k Equity Participation: 0.25% – 0.5% Flexible Work Policy"
  },
  {
    "position": "Full Stack Engineer (Node.js)",
    "url": "https://berlinstartupjobs.com/engineering/full-stack-engineer-node-js-m-f-d-minddoc",
    "skills": "Node.js, JavaScript, Vue.js, React, Angular, Docker, Helm",
    "bulkText": "As a Full Stack Engineer (Node.js) (m/f/d) you… will work with a cross functional agile team on the backend systems that power our therapy platform which is one of the leading digital applications for guided and unguided treatment for mental health are somebody who is familiar with state of the art technology and development stack and best-practices, you have the option to contribute to the technology strategy and roadmap of the team significantly contribute with your day to day work and deliverables to the overall success of our therapy product and its user satisfaction (therapists, patients, patient management) contribute to an engineering culture where developers enjoy working and keep learning You have close contact with our product and QA team as well as our users (e.g, therapist) and help them troubleshoot, debug, and maintain a high quality of our product Your profil You have a track record in building web applications in agile environments.  +4 years experience with any enterprise technology like Javascript and Node.js or similar You have experience using any frontend frameworks like Vue.js, React or Angular You have experience in test-driven development – we work extensively with Jest to ensure we have 100% test coverage throughout You have very good knowledge of Git, development workflow automation and CI. Continuous Delivery is in our DNA.  You know how to use Docker for local development. Basic knowledge of Helm is a plus You have an appreciation for great user experience as much as for awesome tech architecture You are great at communicating with people, motivating everyone and getting the whole team on the same page Fluency in English, German is a plus.  As our products are used by patients with severe mental health diseases, we put a lot of emphasis into secure applications, documentation, verification, and validation to make sure our products are both: beneficial and safe at the same time. This comes with its own challenges for sure, but at the same time provides us the opportunity to deliver a product that really is meaningful, unique in the market and helps people (more than yet another food delivery service probably) The most important one: willingness to learn. We are constantly learning new things and we enjoy it a lot. We don’t expect to find people experienced in all of them. If you are excited about our tech-stack and you think you are a fast learner, do not hesitate to apply!  Our offer 30 vacation days (full-time) Working in a motivated, international team with offices in Berlin and Munich Unique combination of startup spirit and family business – flat hierarchies and direct decision-making processes Complimentary drinks and sponsored lunch Employee benefits at Schoen Clinic such as company pension schemes or discounts from over 600 different brands Rental options for company bikes"
  }
]
